In [43]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns
from pydataset import data
from sklearn.model_selection import train_test_split

import env
import os
import acquire

**Using the Iris Data:**

* Use the function defined in acquire.py to load the iris data.

In [2]:
iris_df = acquire.get_iris_data()
iris_df.head()

this file exists, reading from csv

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

* Clean up the column names - replace the period with an underscore and lowercase.

In [3]:
iris_df.columns = [col.lower().replace('.', '_') for col in iris_df.columns]
iris_df.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

* Drop the species_id and measurement_id columns.

In [4]:
iris_df = iris_df.drop(columns=['species_id','measurement_id'])
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa
2           4.7          3.2           1.3          0.2       setosa
3           4.6          3.1           1.5          0.2       setosa
4           5.0          3.6           1.4          0.2       setosa

* Rename the species_name column to just species.

In [5]:
iris_df = iris_df.rename(columns={'species_name':'species'})
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

* Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [47]:
def prep_iris():
    """
    
    """
    iris_df = acquire.get_iris_data()
    iris_df.columns = [col.lower().replace('.', '_') for col in iris_df.columns]
    iris_df = iris_df.drop(columns=['species_id','measurement_id'])
    iris_df = iris_df.rename(columns={'species_name':'species'})
    
    return iris_df

**Using the Titanic dataset**

* Use the function defined in acquire.py to load the Titanic data.

* Drop any unnecessary, unhelpful, or duplicated columns.

* Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [65]:
def prep_titanic():
    """
    
    """
    df = acquire.get_titanic_data()
    df = df.drop(columns=['embarked','class','age','deck'])
    df.pclass = df.pclass.astype(object)
    df.embark_town = df.embark_town.fillna('Southampton')
    
    return df

**Using the Telco dataset**

* Use the function defined in acquire.py to load the Telco data.

In [8]:
telco_df = acquire.get_telco_data()
telco_df.head()

this file exists, reading from csv

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

* Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [13]:
telco_df.columns

Index(['payment_type_id', 'internet_service_type_id', 'contract_type_id',
       'customer_id', 'gender', 'senior_citizen', 'partner', 'dependents',
       'tenure', 'phone_service', 'multiple_lines', 'online_security',
       'online_backup', 'device_protection', 'tech_support', 'streaming_tv',
       'streaming_movies', 'paperless_billing', 'monthly_charges',
       'total_charges', 'churn', 'contract_type', 'internet_service_type',
       'payment_type'],
      dtype='object')

In [16]:
telco_df = telco_df.drop(columns=['payment_type_id','internet_service_type_id','contract_type_id'])
telco_df.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

* Handle null values.

In [36]:
telco_df.internet_service_type.isnull().sum()

1526

In [37]:
telco_df.internet_service_type.value_counts()

internet_service_type
Fiber optic    3096
DSL            2421
Name: count, dtype: int64

In [38]:
telco_df.internet_service_type.isnull().mean()

0.21666903308249325

In [39]:
telco_df.internet_service_type = telco_df.internet_service_type.notnull()

* Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [63]:
def prep_telco():
    """
    
    """
    telco_df = acquire.get_telco_data()
    telco_df = telco_df.drop(columns=['payment_type_id','internet_service_type_id','contract_type_id'])
    telco_df.internet_service_type = telco_df.internet_service_type.notnull()
    
    return telco_df

**Split your data**

* Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.

In [59]:
def split_data(df, col):
    """
    annotation
    """
    #first split
    train, validate_test = train_test_split(df, #send in initial df
                train_size = 0.60, #size of the train df, and the test size will default to 1-train_size
                random_state = 123, #set any number here for consistency
                stratify = df[col] #we should stratify on our target variable
                )
    
    #second split
    validate, test = train_test_split(validate_test, #we are spliting the 40% df we just made
                test_size = 0.50, #split 50/50
                random_state = 123, #gotta send in a random seed
                stratify = validate_test[col] #still got to stratify
                )
    
    return train, validate, test

* Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.

In [48]:
clean_iris = prep_iris()
clean_iris.head()

this file exists, reading from csv

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [60]:
train_iris, validate_iris, test_iris = split_data(clean_iris, 'species')

In [61]:
print(f'Train: {train_iris.shape}')
print(f'Validate: {validate_iris.shape}')
print(f'Test: {test_iris.shape}')

Train: (90, 5)
Validate: (30, 5)
Test: (30, 5)

* Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.

In [66]:
clean_titanic = prep_titanic()
clean_titanic.head()

this file exists, reading from csv

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embark_town,alone
0,0,0,3,male,1,0,7.2500,Southampton,0
1,1,1,1,female,1,0,71.2833,Cherbourg,0
2,2,1,3,female,0,0,7.9250,Southampton,1
3,3,1,1,female,1,0,53.1000,Southampton,0
4,4,0,3,male,0,0,8.0500,Southampton,1

In [67]:
train_titanic, validate_titanic, test_titanic = split_data(clean_titanic, 'survived')

In [68]:
print(f'Train: {train_titanic.shape}')
print(f'Validate: {validate_titanic.shape}')
print(f'Test: {test_titanic.shape}')

Train: (534, 9)
Validate: (178, 9)
Test: (179, 9)

* Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.

In [69]:
clean_telco = prep_telco()
clean_telco.head()

this file exists, reading from csv

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,True,Mailed check
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,True,Mailed check
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,True,Electronic check
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,True,Electronic check
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,True,Mailed check

In [71]:
train_telco, validate_telco, test_telco = split_data(clean_telco, 'churn')

In [72]:
print(f'Train: {train_telco.shape}')
print(f'Validate: {validate_telco.shape}')
print(f'Test: {test_telco.shape}')

Train: (4225, 21)
Validate: (1409, 21)
Test: (1409, 21)